Rails/W10D4/redditclone/app/controllers/subs_controller.rb

  def show
    @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE (#<Sub::ActiveRecord_Relation:0x00007f79adbc97c8>) LIMIT $1  [["LIMIT", 1]]