Rails/W10D4/redditclone/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def new
      @user = User.new

      render json: User.all