Rails/W10D4/redditclone/app/views/posts/_form.html.erb

SELECT "subs".* FROM "subs"
---
  <input type="hidden" name="post[sub_id][]" value="">
  <% Sub.all.each do |ind_sub| %>